app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 1)
    @last5 = Article.last(5)

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ll"], ["body", "hb"], ["created_at", "2020-04-20 21:03:33.712613"], ["updated_at", "2020-04-20 21:03:33.712613"], ["user_id", 1]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save