app/controllers/contacts_controller.rb

    def create
        @contact = Contact.new(contact_params)

        if @contact.save
---
INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Olga Pietrzyk"], ["email", "olg262@gmail.com"], ["message", "kmjnxjksn"], ["created_at", "2020-04-19 21:46:17.539482"], ["updated_at", "2020-04-19 21:46:17.539482"]]