app/controllers/pages_controller.rb

  def index
    @articles=Article.last(2)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 2]]